# R与Python手牵手：数据的行列操纵

行列操纵乃是ETL的基本功，传统的提取数据并进行转化的工作是由SQL完成的，但是R与Python在解决这方面问题也是游刃有余，让我们看看两者在处理数据基本操作的时候有什么区别。

## Python

In [1]:
#载入模块
import pandas as pd
import numpy as np
import matplotlib.pylab as plt

#载入数据
edu = pd.read_csv('G:/Py/introduction-datascience-python-book-master/files/ch02/educ_figdp_1_Data.csv',
                  na_values=':', usecols=['TIME', 'GEO', 'Value'])   #na_values是把“：”符号认为是缺失值的意思

数据可以在以下网址取得：https://github.com/DataScienceUB/introduction-datascience-python-book

### 行列选择

In [7]:
#选择列，只显示前5行
edu['Value'].head()

0     NaN
1     NaN
2    5.00
3    5.03
4    4.95
Name: Value, dtype: float64

In [3]:
#选择行
edu[10:14]

    TIME                            GEO  Value
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99

### 过滤数据

In [8]:
#条件过滤，取Value大于6.5的行，只显示后5行
edu[edu['Value'] > 6.5].tail()

     TIME      GEO  Value
286  2010    Malta   6.74
287  2011    Malta   7.96
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [9]:
#筛选具有缺失值的数据，只显示前5行
edu[edu['Value'].isnull()].head()

    TIME                            GEO  Value
0   2000  European Union (28 countries)    NaN
1   2001  European Union (28 countries)    NaN
36  2000       Euro area (18 countries)    NaN
37  2001       Euro area (18 countries)    NaN
48  2000       Euro area (17 countries)    NaN

### 汇总数据

In [10]:
#求所有列的最大值
edu.max(axis=0)

TIME      2011
GEO      Spain
Value     8.81
dtype: object

In [16]:
#求Value列的最大值,自动忽略缺失值
edu['Value'].max()

8.81

In [17]:
#把Value列统一除以100
s = edu['Value'] / 100
s.head()

0       NaN
1       NaN
2    0.0500
3    0.0503
4    0.0495
Name: Value, dtype: float64

In [18]:
#构造新一列，名为ValueNorm，把Value列统一除以自身最大值
edu['ValueNorm'] = edu['Value'] / edu['Value'].max()
edu.tail()

     TIME      GEO  Value  ValueNorm
379  2007  Finland   5.90   0.669694
380  2008  Finland   6.10   0.692395
381  2009  Finland   6.81   0.772985
382  2010  Finland   6.85   0.777526
383  2011  Finland   6.76   0.767310

In [19]:
#取Vaule列的开方
s = edu['Value'].apply(np.sqrt)
s.head()

0         NaN
1         NaN
2    2.236068
3    2.242766
4    2.224860
Name: Value, dtype: float64

In [20]:
#取Value列的平方
s = edu['Value'].apply(lambda d: d**2)
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

In [21]:
#删除ValueNorm列，inplace=True参数的设置可以使删除操作直接对原始数据进行，也就是说现在的edu已经改变了
#没有对inplace进行设置的话，返回的是一个拷贝，也就是edu本身仍然没有发生变化

edu.drop('ValueNorm', axis=1, inplace=True)
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [22]:
#在最后添加一行
edu = edu.append({'TIME': 2000, 'Value': 5.00, 'GEO': 'a'}, ignore_index=True)
edu.tail()

     TIME      GEO  Value
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76
384  2000        a   5.00

In [23]:
#删除最后一行
edu.drop(max(edu.index), axis=0, inplace=True)
edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [25]:
#删除Value为缺失值的行
eduDrop = edu.dropna(how='any', subset=['Value'], axis=0)
eduDrop.head()

   TIME                            GEO  Value
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95
5  2005  European Union (28 countries)   4.92
6  2006  European Union (28 countries)   4.91

In [26]:
#给缺失的Value值进行填充，填充值为0
eduFilled = edu.fillna(value={'Value': 0})
eduFilled.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)   0.00
1  2001  European Union (28 countries)   0.00
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95